; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-u-3)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite5 - satellite
	instrument13 - instrument
	instrument14 - instrument
	satellite6 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	image1 - mode
	spectrograph2 - mode
	infrared0 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Planet19 - direction
	Planet20 - direction
	Star21 - direction
	Star22 - direction
	Star23 - direction
	Star24 - direction
	Star25 - direction
	Star26 - direction
	Star27 - direction
	Phenomenon28 - direction
	Star29 - direction
	Phenomenon30 - direction
	Planet31 - direction
	Phenomenon32 - direction
	Planet33 - direction
	Phenomenon34 - direction
	Planet35 - direction
	Phenomenon36 - direction
	Star37 - direction
	Phenomenon38 - direction
	Star39 - direction
	Phenomenon40 - direction
	Planet41 - direction
	Planet42 - direction
	Planet43 - direction
	Phenomenon44 - direction
	Star45 - direction
	Planet46 - direction
	Star47 - direction
	Planet48 - direction
	Star49 - direction
	Star50 - direction
	Planet51 - direction
	Star52 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star50)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
	(supports instrument5 image1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph2)
	(supports instrument6 image1)
	(calibration_target instrument6 Star1)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet14)
	(supports instrument8 spectrograph2)
	(supports instrument8 image1)
	(calibration_target instrument8 Star1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star1)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument10 infrared0)
	(supports instrument10 spectrograph2)
	(supports instrument10 image1)
	(calibration_target instrument10 Star2)
	(supports instrument11 image1)
	(supports instrument11 infrared0)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 Star0)
	(supports instrument12 infrared0)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 Star2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
	(supports instrument13 infrared0)
	(supports instrument13 spectrograph2)
	(supports instrument13 image1)
	(calibration_target instrument13 Star2)
	(supports instrument14 spectrograph2)
	(supports instrument14 infrared0)
	(calibration_target instrument14 Star1)
	(on_board instrument13 satellite5)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet33)
	(supports instrument15 infrared0)
	(calibration_target instrument15 Star2)
	(supports instrument16 infrared0)
	(supports instrument16 spectrograph2)
	(supports instrument16 image1)
	(calibration_target instrument16 Star0)
	(supports instrument17 infrared0)
	(calibration_target instrument17 Star1)
	(on_board instrument15 satellite6)
	(on_board instrument16 satellite6)
	(on_board instrument17 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite1 Phenomenon34)
	(pointing satellite3 Star2)
	(pointing satellite4 Planet14)
	(have_image Star3 infrared0)
	(have_image Star4 spectrograph2)
	(have_image Phenomenon5 spectrograph2)
	(have_image Phenomenon7 spectrograph2)
	(have_image Phenomenon8 image1)
	(have_image Star9 spectrograph2)
	(have_image Star10 spectrograph2)
	(have_image Phenomenon11 spectrograph2)
	(have_image Star12 infrared0)
	(have_image Star13 image1)
	(have_image Planet14 image1)
	(have_image Planet15 infrared0)
	(have_image Star16 image1)
	(have_image Planet17 spectrograph2)
	(have_image Phenomenon18 image1)
	(have_image Planet19 infrared0)
	(have_image Planet20 image1)
	(have_image Star21 spectrograph2)
	(have_image Star22 image1)
	(have_image Star23 image1)
	(have_image Star24 image1)
	(have_image Star25 infrared0)
	(have_image Star26 spectrograph2)
	(have_image Star27 infrared0)
	(have_image Phenomenon28 spectrograph2)
	(have_image Star29 spectrograph2)
	(have_image Phenomenon30 image1)
	(have_image Planet31 spectrograph2)
	(have_image Phenomenon32 image1)
	(have_image Planet33 infrared0)
	(have_image Phenomenon34 infrared0)
	(have_image Planet35 spectrograph2)
	(have_image Phenomenon36 infrared0)
	(have_image Star37 spectrograph2)
	(have_image Star39 image1)
	(have_image Phenomenon40 image1)
	(have_image Planet41 image1)
	(have_image Planet42 image1)
	(have_image Planet43 image1)
	(have_image Phenomenon44 image1)
	(have_image Star45 image1)
	(have_image Star47 spectrograph2)
	(have_image Planet48 image1)
	(have_image Star49 infrared0)
	(have_image Star50 spectrograph2)
	(have_image Planet51 image1)
	(have_image Star52 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 51
2. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 51
3. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 0 of 51
4. (turn_to satellite0 star2 star50)
   deleted: (pointing satellite0 star50)
   added: (pointing satellite0 star2)
   goals met: 0 of 51
5. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 51
6. (turn_to satellite0 phenomenon18 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 51
7. (take_image satellite0 phenomenon18 instrument0 image1)
   added: (have_image phenomenon18 image1)
   goals met: 1 of 51
8. (turn_to satellite0 phenomenon30 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon30)
   goals met: 1 of 51
9. (take_image satellite0 phenomenon30 instrument0 image1)
   added: (have_image phenomenon30 image1)
   goals met: 2 of 51
10. (turn_to satellite0 phenomenon32 phenomenon30)
   deleted: (pointing satellite0 phenomenon30)
   added: (pointing satellite0 phenomenon32)
   goals met: 2 of 51
11. (take_image satellite0 phenomenon32 instrument0 image1)
   added: (have_image phenomenon32 image1)
   goals met: 3 of 51
12. (turn_to satellite0 phenomenon40 phenomenon32)
   deleted: (pointing satellite0 phenomenon32)
   added: (pointing satellite0 phenomenon40)
   goals met: 3 of 51
13. (take_image satellite0 phenomenon40 instrument0 image1)
   added: (have_image phenomenon40 image1)
   goals met: 4 of 51
14. (turn_to satellite0 phenomenon44 phenomenon40)
   deleted: (pointing satellite0 phenomenon40)
   added: (pointing satellite0 phenomenon44)
   goals met: 4 of 51
15. (take_image satellite0 phenomenon44 instrument0 image1)
   added: (have_image phenomenon44 image1)
   goals met: 5 of 51
16. (turn_to satellite0 phenomenon8 phenomenon44)
   deleted: (pointing satellite0 phenomenon44)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 51
17. (take_image satellite0 phenomenon8 instrument0 image1)
   added: (have_image phenomenon8 image1)
   goals met: 6 of 51
18. (turn_to satellite0 planet14 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet14)
   goals met: 6 of 51
19. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 7 of 51
20. (turn_to satellite0 planet20 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet20)
   goals met: 7 of 51
21. (take_image satellite0 planet20 instrument0 image1)
   added: (have_image planet20 image1)
   goals met: 8 of 51
22. (turn_to satellite0 planet41 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 planet41)
   goals met: 8 of 51
23. (take_image satellite0 planet41 instrument0 image1)
   added: (have_image planet41 image1)
   goals met: 9 of 51
24. (turn_to satellite0 planet42 planet41)
   deleted: (pointing satellite0 planet41)
   added: (pointing satellite0 planet42)
   goals met: 9 of 51
25. (take_image satellite0 planet42 instrument0 image1)
   added: (have_image planet42 image1)
   goals met: 10 of 51
26. (turn_to satellite0 planet43 planet42)
   deleted: (pointing satellite0 planet42)
   added: (pointing satellite0 planet43)
   goals met: 10 of 51
27. (take_image satellite0 planet43 instrument0 image1)
   added: (have_image planet43 image1)
   goals met: 11 of 51
28. (turn_to satellite0 planet48 planet43)
   deleted: (pointing satellite0 planet43)
   added: (pointing satellite0 planet48)
   goals met: 11 of 51
29. (take_image satellite0 planet48 instrument0 image1)
   added: (have_image planet48 image1)
   goals met: 12 of 51
30. (turn_to satellite0 planet51 planet48)
   deleted: (pointing satellite0 planet48)
   added: (pointing satellite0 planet51)
   goals met: 12 of 51
31. (take_image satellite0 planet51 instrument0 image1)
   added: (have_image planet51 image1)
   goals met: 13 of 51
32. (turn_to satellite0 star13 planet51)
   deleted: (pointing satellite0 planet51)
   added: (pointing satellite0 star13)
   goals met: 13 of 51
33. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 14 of 51
34. (turn_to satellite0 star16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star16)
   goals met: 14 of 51
35. (take_image satellite0 star16 instrument0 image1)
   added: (have_image star16 image1)
   goals met: 15 of 51
36. (turn_to satellite0 star22 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star22)
   goals met: 15 of 51
37. (take_image satellite0 star22 instrument0 image1)
   added: (have_image star22 image1)
   goals met: 16 of 51
38. (turn_to satellite0 star23 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 star23)
   goals met: 16 of 51
39. (take_image satellite0 star23 instrument0 image1)
   added: (have_image star23 image1)
   goals met: 17 of 51
40. (turn_to satellite0 star24 star23)
   deleted: (pointing satellite0 star23)
   added: (pointing satellite0 star24)
   goals met: 17 of 51
41. (take_image satellite0 star24 instrument0 image1)
   added: (have_image star24 image1)
   goals met: 18 of 51
42. (turn_to satellite0 star39 star24)
   deleted: (pointing satellite0 star24)
   added: (pointing satellite0 star39)
   goals met: 18 of 51
43. (take_image satellite0 star39 instrument0 image1)
   added: (have_image star39 image1)
   goals met: 19 of 51
44. (turn_to satellite0 star45 star39)
   deleted: (pointing satellite0 star39)
   added: (pointing satellite0 star45)
   goals met: 19 of 51
45. (take_image satellite0 star45 instrument0 image1)
   added: (have_image star45 image1)
   goals met: 20 of 51
46. (turn_to satellite0 star52 star45)
   deleted: (pointing satellite0 star45)
   added: (pointing satellite0 star52)
   goals met: 20 of 51
47. (take_image satellite0 star52 instrument0 image1)
   added: (have_image star52 image1)
   goals met: 21 of 51
48. (turn_to satellite4 phenomenon11 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon11)
   goals met: 21 of 51
49. (take_image satellite4 phenomenon11 instrument10 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 22 of 51
50. (turn_to satellite4 phenomenon28 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon28)
   goals met: 22 of 51
51. (take_image satellite4 phenomenon28 instrument10 spectrograph2)
   added: (have_image phenomenon28 spectrograph2)
   goals met: 23 of 51
52. (turn_to satellite4 phenomenon34 phenomenon28)
   deleted: (pointing satellite4 phenomenon28)
   added: (pointing satellite4 phenomenon34)
   goals met: 23 of 51
53. (take_image satellite4 phenomenon34 instrument10 infrared0)
   added: (have_image phenomenon34 infrared0)
   goals met: 24 of 51
54. (turn_to satellite4 phenomenon36 phenomenon34)
   deleted: (pointing satellite4 phenomenon34)
   added: (pointing satellite4 phenomenon36)
   goals met: 24 of 51
55. (take_image satellite4 phenomenon36 instrument10 infrared0)
   added: (have_image phenomenon36 infrared0)
   goals met: 25 of 51
56. (turn_to satellite4 phenomenon5 phenomenon36)
   deleted: (pointing satellite4 phenomenon36)
   added: (pointing satellite4 phenomenon5)
   goals met: 25 of 51
57. (take_image satellite4 phenomenon5 instrument10 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 26 of 51
58. (turn_to satellite4 phenomenon7 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 phenomenon7)
   goals met: 26 of 51
59. (take_image satellite4 phenomenon7 instrument10 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 27 of 51
60. (turn_to satellite4 planet15 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 planet15)
   goals met: 27 of 51
61. (take_image satellite4 planet15 instrument10 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 28 of 51
62. (turn_to satellite4 planet17 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet17)
   goals met: 28 of 51
63. (take_image satellite4 planet17 instrument10 spectrograph2)
   added: (have_image planet17 spectrograph2)
   goals met: 29 of 51
64. (turn_to satellite4 planet19 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet19)
   goals met: 29 of 51
65. (take_image satellite4 planet19 instrument10 infrared0)
   added: (have_image planet19 infrared0)
   goals met: 30 of 51
66. (turn_to satellite4 planet31 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet31)
   goals met: 30 of 51
67. (take_image satellite4 planet31 instrument10 spectrograph2)
   added: (have_image planet31 spectrograph2)
   goals met: 31 of 51
68. (turn_to satellite4 planet33 planet31)
   deleted: (pointing satellite4 planet31)
   added: (pointing satellite4 planet33)
   goals met: 31 of 51
69. (take_image satellite4 planet33 instrument10 infrared0)
   added: (have_image planet33 infrared0)
   goals met: 32 of 51
70. (turn_to satellite4 planet35 planet33)
   deleted: (pointing satellite4 planet33)
   added: (pointing satellite4 planet35)
   goals met: 32 of 51
71. (take_image satellite4 planet35 instrument10 spectrograph2)
   added: (have_image planet35 spectrograph2)
   goals met: 33 of 51
72. (turn_to satellite4 star10 planet35)
   deleted: (pointing satellite4 planet35)
   added: (pointing satellite4 star10)
   goals met: 33 of 51
73. (take_image satellite4 star10 instrument10 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 34 of 51
74. (turn_to satellite4 star12 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star12)
   goals met: 34 of 51
75. (take_image satellite4 star12 instrument10 infrared0)
   added: (have_image star12 infrared0)
   goals met: 35 of 51
76. (turn_to satellite4 star21 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 star21)
   goals met: 35 of 51
77. (take_image satellite4 star21 instrument10 spectrograph2)
   added: (have_image star21 spectrograph2)
   goals met: 36 of 51
78. (turn_to satellite4 star25 star21)
   deleted: (pointing satellite4 star21)
   added: (pointing satellite4 star25)
   goals met: 36 of 51
79. (take_image satellite4 star25 instrument10 infrared0)
   added: (have_image star25 infrared0)
   goals met: 37 of 51
80. (turn_to satellite4 star26 star25)
   deleted: (pointing satellite4 star25)
   added: (pointing satellite4 star26)
   goals met: 37 of 51
81. (take_image satellite4 star26 instrument10 spectrograph2)
   added: (have_image star26 spectrograph2)
   goals met: 38 of 51
82. (turn_to satellite4 star27 star26)
   deleted: (pointing satellite4 star26)
   added: (pointing satellite4 star27)
   goals met: 38 of 51
83. (take_image satellite4 star27 instrument10 infrared0)
   added: (have_image star27 infrared0)
   goals met: 39 of 51
84. (turn_to satellite4 star29 star27)
   deleted: (pointing satellite4 star27)
   added: (pointing satellite4 star29)
   goals met: 39 of 51
85. (take_image satellite4 star29 instrument10 spectrograph2)
   added: (have_image star29 spectrograph2)
   goals met: 40 of 51
86. (turn_to satellite4 star3 star29)
   deleted: (pointing satellite4 star29)
   added: (pointing satellite4 star3)
   goals met: 40 of 51
87. (take_image satellite4 star3 instrument10 infrared0)
   added: (have_image star3 infrared0)
   goals met: 41 of 51
88. (turn_to satellite4 star37 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 star37)
   goals met: 41 of 51
89. (take_image satellite4 star37 instrument10 spectrograph2)
   added: (have_image star37 spectrograph2)
   goals met: 42 of 51
90. (turn_to satellite4 star4 star37)
   deleted: (pointing satellite4 star37)
   added: (pointing satellite4 star4)
   goals met: 42 of 51
91. (take_image satellite4 star4 instrument10 spectrograph2)
   added: (have_image star4 spectrograph2)
   goals met: 43 of 51
92. (turn_to satellite4 star47 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 star47)
   goals met: 43 of 51
93. (take_image satellite4 star47 instrument10 spectrograph2)
   added: (have_image star47 spectrograph2)
   goals met: 44 of 51
94. (turn_to satellite4 star49 star47)
   deleted: (pointing satellite4 star47)
   added: (pointing satellite4 star49)
   goals met: 44 of 51
95. (take_image satellite4 star49 instrument10 infrared0)
   added: (have_image star49 infrared0)
   goals met: 45 of 51
96. (turn_to satellite4 star50 star49)
   deleted: (pointing satellite4 star49)
   added: (pointing satellite4 star50)
   goals met: 45 of 51
97. (take_image satellite4 star50 instrument10 spectrograph2)
   added: (have_image star50 spectrograph2)
   goals met: 46 of 51
98. (turn_to satellite4 star9 star50)
   deleted: (pointing satellite4 star50)
   added: (pointing satellite4 star9)
   goals met: 46 of 51
99. (take_image satellite4 star9 instrument10 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 47 of 51
100. (turn_to satellite0 star10 star52)
   deleted: (pointing satellite0 star52)
   added: (pointing satellite0 star10)
   goals met: 48 of 51
101. (turn_to satellite1 phenomenon34 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 phenomenon34)
   goals met: 49 of 51
102. (turn_to satellite3 star2 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 star2)
   goals met: 50 of 51
103. (turn_to satellite4 planet14 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 planet14)
   goals met: 51 of 51
